1. Create a new column called **professor_initials** that stores the initials of each professor's first and last names. Use the following data:

In [1]:
import pandas as pd
data = {
    'professor': ['Ludmila Kuncheva', 'Antonio Torralba', 'Manuel Gonzalez', 'Bastian Leibe'],
    'department': ['Computer Science', 'Computer Vision', 'AI & Robotics', 'Autonomous Systems'],
    'age': [45, 50, 47, 38]
}

df = pd.DataFrame(data)
df[['first_name', 'last_name']] = df['professor'].str.split(' ', expand=True)
df
df['professor_initials'] = df['first_name'].str.extract(r'(^.)') + df['last_name'].str.extract(r'(^.)')
df['professor_initials']

0    LK
1    AT
2    MG
3    BL
Name: professor_initials, dtype: object

2. Given the dataframe below. Use **join** to combine this new DataFrame with the original one based on the professor column.

In [2]:

courses_data = {
    'professor': ['Ludmila Kuncheva', 'Antonio Torralba', 'Manuel Gonzalez', 'Bastian Leibe'],
    'courses': ['Machine Learning', 'Computer Vision', 'AI Programming', 'Self-Driving Cars']
}
df_courses = pd.DataFrame(courses_data)

df_courses.set_index('professor', inplace=True)
df.join(df_courses, on= 'professor', how= 'inner')

,professor,department,age,first_name,last_name,professor_initials,courses
0,Ludmila Kuncheva,Computer Science,45,Ludmila,Kuncheva,LK,Machine Learning
1,Antonio Torralba,Computer Vision,50,Antonio,Torralba,AT,Computer Vision
2,Manuel Gonzalez,AI & Robotics,47,Manuel,Gonzalez,MG,AI Programming
3,Bastian Leibe,Autonomous Systems,38,Bastian,Leibe,BL,Self-Driving Cars

3. Combine the original df and df_courses DataFrames.

In [3]:
data = {
    'professor': ['Ludmila Kuncheva', 'Antonio Torralba', 'Manuel Gonzalez', 'Bastian Leibe'],
    'department': ['Computer Science', 'Computer Vision', 'AI & Robotics', 'Autonomous Systems'],
    'age': [45, 50, 47, 38]
}

df = pd.DataFrame(data)

courses_data = {
    'professor': ['Ludmila Kuncheva', 'Antonio Torralba', 'Manuel Gonzalez', 'Bastian Leibe'],
    'courses': ['Machine Learning', 'Computer Vision', 'AI Programming', 'Self-Driving Cars']
}
df_courses = pd.DataFrame(courses_data)

df_courses.set_index('professor', inplace=True)
df.join(df_courses, on= 'professor', how= 'inner')

          professor          department  age            courses
0  Ludmila Kuncheva    Computer Science   45   Machine Learning
1  Antonio Torralba     Computer Vision   50    Computer Vision
2   Manuel Gonzalez       AI & Robotics   47     AI Programming
3     Bastian Leibe  Autonomous Systems   38  Self-Driving Cars

4. In the professor column, create a new column professor_last_name by extracting the last name of each professor using string operations.

In [4]:
#df = df[['first_name', 'last_name']] = df['professor'].str.split(' ', expand=True)
df['professor_last_name'] = df['professor'].str.extract(r'\s(\S+)$')
df

          professor          department  age professor_last_name
0  Ludmila Kuncheva    Computer Science   45            Kuncheva
1  Antonio Torralba     Computer Vision   50            Torralba
2   Manuel Gonzalez       AI & Robotics   47            Gonzalez
3     Bastian Leibe  Autonomous Systems   38               Leibe